Repository: FilipKanar/One
Catalog: lib/l10n/intl_*.arb
Languages: pl

# errorSignInCredentials
source: Could not sign in with those credentials
pl: Błąd logowania przy użyciu podanych danych

# errorSignUpCredentials
source: Could not sign up with those credentials
pl: Błąd rejestracji przy użyciu podanych danych

# appOverview
source: Overview
pl: Podgląd

# passwordPlaceholder
source: Password
pl: Hasło

# confirmPasswordPlaceholder
source: Confirm Password
pl: Potwierdź hasło

# logInPlaceholder
source: Log In
pl: Zaloguj

# registerPlaceholder
source: Register
pl: Zarejestruj

# acceptPlaceholder
source: Accept
pl: Zaakceptuj

# privacyPolicyPlaceholder
source: Privacy Policy
pl: Politykę Prywatności

# loginSuccessfulToast
source: Login Successful
pl: Zalogowano pomyślnie

# registrationSuccessfulToast
source: Registration Successful
pl: Zarejestrowano Pomyślnie

# googlePrivacyPolicyMessage
source: Privacy Policy required for google authentication
pl: Polityka Prywatności jest wymagana do zalogowania się

# testUserLogInErrorMessage
source: Could not sign in to test account
pl: Błąd logowania na konto testowe

# userPositionPlaceholder
source: Your position
pl: Twoja pozycja w rankingu

# userScorePlaceholder
source: Your Score
pl: Twój wynik

# profilePlaceholder
source: Profile
pl: Profil

# changePlaceholder
source: Change
pl: Zmień

# trashCollectedPlaceholder
source: Trash Collected
pl: Zebrane śmieci

# pointsCreatedPlaceholder
source: Points Created
pl: Stworzone punkty

# noPictureProvidedErrorTitle
source: No picture provided
pl: Brak zdjęcia

# noPictureProvidedErrorMessage
source: Take picture of littered place. Select ONE trash you will throw out. Be happy.
pl: Zrób zdjęcie miejsca w którym znajdują się śmieci. Zaznacz JEDEN który wyniesiesz. Wynieś.

# publicPlaceholder
source: Public
pl: Opublikuj

# addPointPlaceholder
source: Add New Point
pl: Dodaj Punkt

# newCleaningPointTitle
source: New cleaning point
pl: Dodaj nowy punkt

# descriptionLengthValidator
source: Provide description longer than 5 signs
pl: Opis musi być dłuższy niż 5 znaków

# pointNameHintText
source: Name this point
pl: Nazwij punkt

# saveAndContinueTip
source: Save and continue
pl: Zapisz i kontynuuj

# commentsScreenTitle
source: Comments
pl: Komentarze

# newCommentHintText
source: New comment
pl: Nowy komentarz

# newCommentLengthValidatorText
source: Comment must be at least 10 characters long
pl: Komentarz musi składać się z minimum 10 znaków

# newCommentAddErrorMessage
source: Failed adding comment
pl: Błąd dodawania komentarza

# noCommentsToDisplayMessage
source: No comments to display
pl: Brak komentarzy do wyświetlenia

# noPointsToDisplayMessage
source: No Points to display
pl: Brak punktów do wyświetlenia

# firstCleaningAchievementTextTitle
source: First Cleaning
pl: Pierwsze sprzątanie

# firstCleaningAchievementTextMessage
source: Clean new cleaning point or contribute to existing one
pl: Stwórz nowy punkt lub dołącz się do sprzątania innego

# fiveCleaningAchievementTextTitle
source: Five Cleanings
pl: Pięć śmieci

# fiveCleaningAchievementTextMessage
source: Clean Five times
pl: Podnieś 5 śmieci

# tenCleaningAchievementTextTitle
source: Ten Cleanings
pl: Dziesięć śmieci

# tenCleaningAchievementTextMessage
source: Clean Ten times
pl: Podnieś dziesięć śmieci

# twentyFiveCleaningAchievementTextTitle
source: Twenty Five Cleanings
pl: Dwadzieścia pięć śmieci

# twentyFiveCleaningAchievementTextMessage
source: Clean Twenty Five times
pl: Podnieś 25 śmieci

# fiftyCleaningAchievementTextTitle
source: Fifty Cleanings
pl: Pięćdziesiąt śmieci

# fiftyFiveCleaningAchievementTextMessage
source: Clean Fifty times
pl: Podnieś pięćdziesiąt śmieci

# hundredCleaningAchievementTextTitle
source: Hundred Cleanings
pl: Sto śmieci

# hundredFiveCleaningAchievementTextMessage
source: Clean Hundred times
pl: Podnieś sto śmieci

# firstPointAchievementTextTitle
source: First point
pl: Pierwszy punkt

# firstPointAchievementTextMessage
source: Create One cleaning point
pl: Stwórz nowy punkt do posprzątania

# fivePointAchievementTextTitle
source: Five points
pl: Pięć punktów

# fivePointAchievementTextMessage
source: Create Five cleaning points
pl: Stwórz 5 punktów

# tenPointAchievementTextTitle
source: Ten points
pl: Dziesięć punktów

# tenPointAchievementTextMessage
source: Create Ten cleaning points
pl: Stwórz 10 punktów

# twentyFivePointAchievementTextTitle
source: Twenty five points
pl: Dwadzieścia pięć punktów

# twentyFivePointAchievementTextMessage
source: Create Twenty five cleaning points
pl: Stwórz 25 punktów

# fiftyPointAchievementTextTitle
source: Fifty points
pl: Pięćdziesiąt punktów

# fiftyPointAchievementTextMessage
source: Create Fifty cleaning points
pl: Stwórz 50 punktów

# addPointButtonText
source: Add new point
pl: Dodaj nowy punkt

# changeUsernamePlaceholder
source: Change Username
pl: Zmień nazwę użytkownika

# usernamePlaceholder
source: Username
pl: Nazwa użytkownika

# scorePlaceholder
source: Score
pl: Wynik

# provideValidEmailValidationText
source: Please provide a valid email
pl: Podaj poprawny adres Email

# passwordLengthValidationText
source: The password must be at least 6 characters long and contain at least 1 numeric and capital letter
pl: Hasło musi składać się przynajmniej z 6 zanków oraz zawierać jedną cyfrę i wielką literę.

# passwordConformationValidationText
source: Passwords do not match
pl: Hasła różnią się od siebie

# usernameLengthValidationText
source: The username must be at least 6 characters long
pl: Nazwa użytkownia musi składać się przynajmniej z 6 znaków

# chooseUsernameDialogMessage
source: Your username will be visible to other users
pl: Nazwa użytkowanika będzie widoczna dla innych użytkowników

# locationPermissionWarningTitle
source: Permission
pl: Lokalizacja

# locationPermissionWarningMessage
source: Location permission required
pl: Aby korzystać z aplikacji zezwól na lokalizację

# storagePermissionWarningTitle
source: Storage
pl: Pamięć

# storagePermissionWarningMessage
source: Storage permission required
pl: Wymagane pozwolenie na przechowywanie

# testUserWarningTitle
source: Test User
pl: Użytkownik testowy

# testUserWarningMessage
source: You are signed in as a test user. Create an account to clean the world.
pl: Jesteś zalogowany jako użytkownik testowy. Załóż konto aby kontynuować.

# continuePlaceholder
source: Continue
pl: Kontynuuj

# cancelPlaceholder
source: Cancel
pl: Anuluj

# allowPermissionPlaceholder
source: Allow Permission
pl: Zezwól

# pointNamePlaceholder
source: Point name:
pl: Nazwa punktu

# commentDeleteDialogTitle
source: Delete comment
pl: Usuń komentarz

# commentDeleteDialogMessage
source: Are you sure that you want to permanently delete selected comment?
pl: Czy chcesz usunąć wyubrany komentarz?

# pointDeleteDialogTitle
source: Delete point
pl: Usuń punkt

# pointDeleteDialogMessage
source: Are you sure that you want to permanently delete selected point?
pl: Czy chcesz usunąć wybrany punkt?

# yesPlaceholder
source: Yes
pl: Tak

# cleaningDeleteDialogTitle
source: Delete Cleaning
pl: Usuń sprzątanie

# cleaningDeleteDialogMessage
source: Are you sure that you want to permanently delete selected cleaning?
pl: Czy chcesz usunąć wybrane sprzątanie?

# lastTrashAtPointPlaceholder
source: It's last trash at this point
pl: To był już ostatni śmieć w tym miejscu
